uploads/xml/Travelport-Request-6563b5563f134-6460.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="e8218d140c3ebe4b80b2eff9495e98a8">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="ALG"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="BJL"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2023-12-25">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="BJL"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="ALG"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-01-01">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
